wakabayashiryo/Library/Common/Chan_FatFs/LPC1769fatfs/src/ElectricBoard.c
/*
===============================================================================
 Name        : ElectricBoard.c
 Author      : $(author)
 Version     :
 Copyright   : $(copyright)
 Description : main definition
===============================================================================
*/
/*if you want to run 120MHz for LPC17697's clock,
 * define "define PLL0CFG_Val 0x00050063" into system_LPC17xx.c.
 */
#ifdef __USE_CMSIS
#include "LPC17xx.h"
#endif
#include <stdint.h>
#include <math.h>
#include <string.h>
#include <cr_section_macros.h>
#include "Timer.h"
#include "PinConfig.h"
#include "Panel.h"
#include "UART.h"
#include "SPI.h"

#include "fatfs/rtc176x.h"
#include "xprintf.h"
#include "fatfs/diskio.h"
#include "fatfs/ff.h"

void GPIO_Init(void);
extern void disk_timerproc (void);
DWORD AccSize;				/* Work register for fs command */
WORD AccFiles, AccDirs;
FILINFO Finfo;

char Line[256];				/* Console input buffer */
BYTE Buff[16384] __attribute__ ((aligned (4))) ;	/* Working buffer */

FATFS FatFs;				/* File system object for each logical drive */
FIL File[2];				/* File objects */
DIR Dir;					/* Directory object */

volatile UINT Timer;


/*---------------------------------------------*/
/* 1kHz timer process                          */
/*---------------------------------------------*/


//void TIMER1_IRQHandler(void)
void SysTick_Handler(void)
{
	static int led_timer;


	Timer++;	/* Increment performance counter */

	if (++led_timer >= 500) {
		led_timer = 0;
	}

	disk_timerproc();	/* Disk timer process */
}

/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */


DWORD get_fattime (void)
{
	RTC rtc;

	/* Get local time */
	rtc_gettime(&rtc);

	/* Pack date and time into a DWORD variable */
	return	  ((DWORD)(rtc.year - 1980) << 25)
			| ((DWORD)rtc.month << 21)
			| ((DWORD)rtc.mday << 16)
			| ((DWORD)rtc.hour << 11)
			| ((DWORD)rtc.min << 5)
			| ((DWORD)rtc.sec >> 1);
}


/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */
/*--------------------------------------------------------------------------*/

static
FRESULT scan_files (
	char* path		/* Pointer to the path name working buffer */
)
{
	DIR dirs;
	FRESULT res;
	BYTE i;
	char *fn;


	if ((res = f_opendir(&dirs, path)) == FR_OK) {
		i = strlen(path);
		while (((res = f_readdir(&dirs, &Finfo)) == FR_OK) && Finfo.fname[0]) {
			if (_FS_RPATH && Finfo.fname[0] == '.') continue;
#if _USE_LFN
			fn = *Finfo.lfname ? Finfo.lfname : Finfo.fname;
#else
			fn = Finfo.fname;
#endif
			if (Finfo.fattrib & AM_DIR) {
				AccDirs++;
				*(path+i) = '/'; strcpy(path+i+1, fn);
				res = scan_files(path);
				*(path+i) = '\0';
				if (res != FR_OK) break;
			} else {
			/*	xprintf("%s/%s\n", path, fn); */
				AccFiles++;
				AccSize += Finfo.fsize;
			}
		}
	}

	return res;
}



static
void put_rc (FRESULT rc)
{
	const char *str =
		"OK\0" "DISK_ERR\0" "INT_ERR\0" "NOT_READY\0" "NO_FILE\0" "NO_PATH\0"
		"INVALID_NAME\0" "DENIED\0" "EXIST\0" "INVALID_OBJECT\0" "WRITE_PROTECTED\0"
		"INVALID_DRIVE\0" "NOT_ENABLED\0" "NO_FILE_SYSTEM\0" "MKFS_ABORTED\0" "TIMEOUT\0"
		"LOCKED\0" "NOT_ENOUGH_CORE\0" "TOO_MANY_OPEN_FILES\0";
	FRESULT i;

	for (i = 0; i != rc && *str; i++) {
		while (*str++) ;
	}
	xprintf("rc=%u FR_%s\n", (UINT)rc, str);
}



static
const char HelpMsg[] =
	"[Disk contorls]\n"
	" di <pd#> - Initialize disk\n"
	" dd [<pd#> <lba>] - Dump a secrtor\n"
	" ds <pd#> - Show disk status\n"
	"[Buffer controls]\n"
	" bd <ofs> - Dump working buffer\n"
	" be <ofs> [<data>] ... - Edit working buffer\n"
	" br <pd#> <lba> [<count>] - Read disk into working buffer\n"
	" bw <pd#> <lba> [<count>] - Write working buffer into disk\n"
	" bf <val> - Fill working buffer\n"
	"[File system controls]\n"
	" fi <ld#> [<mount>]- Force initialized the volume\n"
	" fs [<path>] - Show volume status\n"
	" fl [<path>] - Show a directory\n"
	" fL <path> <pat> - Search directory\n"
	" fo <mode> <file> - Open a file\n"
	" fc - Close the file\n"
	" fe <ofs> - Move fp in normal seek\n"
	" fd <len> - Read and dump the file\n"
	" fr <len> - Read the file\n"
	" fw <len> <val> - Write to the file\n"
	" fn <org.name> <new.name> - Rename an object\n"
	" fu <name> - Unlink an object\n"
	" fv - Truncate the file at current fp\n"
	" fk <name> - Create a directory\n"
	" fa <atrr> <mask> <object name> - Change attribute of an object\n"
	" ft <year> <month> <day> <hour> <min> <sec> <name> - Change timestamp of an object\n"
	" fx <src.file> <dst.file> - Copy a file\n"
	" fg <path> - Change current directory\n"
	" fq - Show current directory\n"
	" fb <name> - Set volume label\n"
	" fm <ld#> <rule> <csize> - Create file system\n"
	" fz [<len>] - Change/Show R/W length for fr/fw/fx command\n"
	"[Misc commands]\n"
	" p <wavfile> - Play RIFF-WAVE file\n"
	" md[b|h|w] <addr> [<count>] - Dump memory\n"
	" mf <addr> <value> <count> - Fill memory\n"
	" me[b|h|w] <addr> [<value> ...] - Edit memory\n"
	" t [<year> <mon> <mday> <hour> <min> <sec>] - Set/Show RTC\n"
	"\n";


int main (void)
{
	SETTIMER TM0;

	GPIO_Init();
	PanelGPIO_Init();
	//UART_Init();
	//SPI_Init(SSPMASTER,SSPMASTER);

	TM0.PR = 100;
	TM0.MR0 = 200;
	TM0.MRRESET = 0x01;//Reset TC0 by matching register 0
	TM0.MRHAND = 0x01;//enable interrupt by timer0
	TM0.TMRHAND = 1;
	Timer0_Init(&TM0);

	char *ptr, *ptr2;
	long p1, p2, p3;
	BYTE res, b, drv = 0;
	UINT s1, s2, cnt, blen = sizeof Buff;
	static const BYTE ft[] = {0, 12, 16, 32};
	DWORD ofs = 0, sect = 0, blk[2];
	FATFS *fs;
	RTC rtc;


	/* Set LED port as output */

	/* Enable SysTick timer as 1 ms interval timer */
	SysTick_Config(SystemCoreClock/(1001-1));

	rtc_initialize();	/* Initiazlize RTC */

#if _USE_LFN	/* Initialize file info structure if in LFN cfg */
	Finfo.lfname = Lfname;
	Finfo.lfsize = sizeof Lfname;
#endif

	/* Initialize UART0 and attach it to xprintf module for console */
	UART_Init();
	xdev_out(UART3_Write);
	xdev_in(UART3_Read);
	xputs("LPC1768 test monitor\n");
	xputs(_USE_LFN ? "LFN Enabled" : "LFN Disabled");
	xprintf(", Code page: %u\n", _CODE_PAGE);

	while(1)
	{
				xputc('>');
				xgets(Line, sizeof Line);

				ptr = Line;
				switch (*ptr++) {
				case '?' :	/* Show Command List */
					xputs(HelpMsg);
					break;

				case 'm' :	/* Memory dump/fill/edit */
					switch (*ptr++) {
					case 'd' :	/* md[b|h|w] <address> [<count>] - Dump memory */
						switch (*ptr++) {
						case 'w': p3 = DW_LONG; break;
						case 'h': p3 = DW_SHORT; break;
						default: p3 = DW_CHAR;
						}
						if (!xatoi(&ptr, &p1)) break;
						if (!xatoi(&ptr, &p2)) p2 = 128 / p3;
						for (ptr = (char*)p1; p2 >= 16 / p3; ptr += 16, p2 -= 16 / p3)
							put_dump(ptr, (DWORD)ptr, 16 / p3, p3);
						if (p2) put_dump((BYTE*)ptr, (UINT)ptr, p2, p3);
						break;
					case 'f' :	/* mf <address> <value> <count> - Fill memory */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;
						while (p3--) {
							*(BYTE*)p1 = (BYTE)p2;
							p1++;
						}
						break;
					case 'e' :	/* me[b|h|w] <address> [<value> ...] - Edit memory */
						switch (*ptr++) {	/* Get data width */
						case 'w': p3 = DW_LONG; break;
						case 'h': p3 = DW_SHORT; break;
						default: p3 = DW_CHAR;
						}
						if (!xatoi(&ptr, &p1)) break;	/* Get start address */
						if (xatoi(&ptr, &p2)) {	/* 2nd parameter is given (direct mode) */
							do {
								switch (p3) {
								case DW_LONG: *(DWORD*)p1 = (DWORD)p2; break;
								case DW_SHORT: *(WORD*)p1 = (WORD)p2; break;
								default: *(BYTE*)p1 = (BYTE)p2;
								}
								p1 += p3;
							} while (xatoi(&ptr, &p2));	/* Get next value */
							break;
						}
						for (;;) {				/* 2nd parameter is not given (interactive mode) */
							switch (p3) {
							case DW_LONG: xprintf("%08X 0x%08X-", p1, *(DWORD*)p1); break;
							case DW_SHORT: xprintf("%08X 0x%04X-", p1, *(WORD*)p1); break;
							default: xprintf("%08X 0x%02X-", p1, *(BYTE*)p1);
							}
							ptr = Line; xgets(ptr, sizeof Line);
							if (*ptr == '.') break;
							if ((BYTE)*ptr >= ' ') {
								if (!xatoi(&ptr, &p2)) continue;
								switch (p3) {
								case DW_LONG: *(DWORD*)p1 = (DWORD)p2; break;
								case DW_SHORT: *(WORD*)p1 = (WORD)p2; break;
								default: *(BYTE*)p1 = (BYTE)p2;
								}
							}
							p1 += p3;
						}
						break;
					}
					break;

				case 'd' :	/* Disk I/O layer controls */
					switch (*ptr++) {
					case 'd' :	/* dd [<pd#> <sect>] - Dump secrtor */
						if (!xatoi(&ptr, &p1)) {
							p1 = drv; p2 = sect;
						} else {
							if (!xatoi(&ptr, &p2)) break;
						}
						drv = (BYTE)p1; sect = p2;
						res = disk_read(drv, Buff, sect, 1);
						if (res) { xprintf("rc=%d\n", (WORD)res); break; }
						xprintf("PD#:%u LBA:%lu\n", drv, sect++);
						for (ptr=(char*)Buff, ofs = 0; ofs < 0x200; ptr += 16, ofs += 16)
							put_dump((BYTE*)ptr, ofs, 16, DW_CHAR);
						break;

					case 'i' :	/* di <pd#> - Initialize disk */
						if (!xatoi(&ptr, &p1)) break;
						xprintf("rc=%d\n", (WORD)disk_initialize((BYTE)p1));
						break;

					case 's' :	/* ds <pd#> - Show disk status */
						if (!xatoi(&ptr, &p1)) break;
						if (disk_ioctl((BYTE)p1, GET_SECTOR_COUNT, &p2) == RES_OK)
							{ xprintf("Drive size: %lu sectors\n", p2); }
						if (disk_ioctl((BYTE)p1, GET_BLOCK_SIZE, &p2) == RES_OK)
							{ xprintf("Block size: %lu sectors\n", p2); }
						if (disk_ioctl((BYTE)p1, MMC_GET_TYPE, &b) == RES_OK)
							{ xprintf("Media type: %u\n", b); }
						if (disk_ioctl((BYTE)p1, MMC_GET_CSD, Buff) == RES_OK)
							{ xputs("CSD:\n"); put_dump(Buff, 0, 16, DW_CHAR); }
						if (disk_ioctl((BYTE)p1, MMC_GET_CID, Buff) == RES_OK)
							{ xputs("CID:\n"); put_dump(Buff, 0, 16, DW_CHAR); }
						if (disk_ioctl((BYTE)p1, MMC_GET_OCR, Buff) == RES_OK)
							{ xputs("OCR:\n"); put_dump(Buff, 0, 4, DW_CHAR); }
						if (disk_ioctl((BYTE)p1, MMC_GET_SDSTAT, Buff) == RES_OK) {
							xputs("SD Status:\n");
							for (s1 = 0; s1 < 64; s1 += 16) put_dump(Buff+s1, s1, 16, DW_CHAR);
						}
						break;

					case 'c' :	/* Disk ioctl */
						switch (*ptr++) {
						case 's' :	/* dcs <pd#> - CTRL_SYNC */
							if (!xatoi(&ptr, &p1)) break;
							xprintf("rc=%d\n", disk_ioctl((BYTE)p1, CTRL_SYNC, 0));
							break;
						case 'e' :	/* dce <pd#> <s.lba> <e.lba> - CTRL_TRIM */
							if (!xatoi(&ptr, &p1) || !xatoi(&ptr, (long*)&blk[0]) || !xatoi(&ptr, (long*)&blk[1])) break;
							xprintf("rc=%d\n", disk_ioctl((BYTE)p1, CTRL_TRIM, blk));
							break;
						}
						break;
					}
					break;

