wakabayashiryo/Library/Common/Chan_FatFs/LPC1769fatfs/src/ElectricBoard.c
				case 'b' :	/* Buffer controls */
					switch (*ptr++) {
					case 'd' :	/* bd <ofs> - Dump R/W buffer */
						if (!xatoi(&ptr, &p1)) break;
						for (ptr=(char*)&Buff[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr+=16, ofs+=16)
							put_dump((BYTE*)ptr, ofs, 16, DW_CHAR);
						break;

					case 'e' :	/* be <ofs> [<data>] ... - Edit R/W buffer */
						if (!xatoi(&ptr, &p1)) break;
						if (xatoi(&ptr, &p2)) {
							do {
								Buff[p1++] = (BYTE)p2;
							} while (xatoi(&ptr, &p2));
							break;
						}
						for (;;) {
							xprintf("%04X %02X-", (WORD)(p1), (WORD)Buff[p1]);
							xgets(Line, sizeof Line);
							ptr = Line;
							if (*ptr == '.') break;
							if (*ptr < ' ') { p1++; continue; }
							if (xatoi(&ptr, &p2))
								Buff[p1++] = (BYTE)p2;
							else
								xputs("???\n");
						}
						break;

					case 'r' :	/* br <pd#> <lba> [<num>] - Read disk into R/W buffer */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;
						if (!xatoi(&ptr, &p3)) p3 = 1;
						xprintf("rc=%u\n", (WORD)disk_read((BYTE)p1, Buff, p2, p3));
						break;

					case 'w' :	/* bw <pd#> <lba> [<num>] - Write R/W buffer into disk */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;
						if (!xatoi(&ptr, &p3)) p3 = 1;
						xprintf("rc=%u\n", (WORD)disk_write((BYTE)p1, Buff, p2, p3));
						break;

					case 'f' :	/* bf <val> - Fill working buffer */
						if (!xatoi(&ptr, &p1)) break;
						memset(Buff, (BYTE)p1, sizeof Buff);
						break;

					}
					break;

				case 'f' :	/* FatFS API controls */
					switch (*ptr++) {

					case 'i' :	/* fi [<opt>]- Initialize logical drive */
						if (!xatoi(&ptr, &p2)) p2 = 0;
						put_rc(f_mount(&FatFs, "", (BYTE)p2));
						break;

					case 's' :	/* fs [<path>] - Show volume status */
						while (*ptr == ' ') ptr++;
						res = f_getfree(ptr, (DWORD*)&p1, &fs);
						if (res) { put_rc(res); break; }
						xprintf("FAT type = FAT%u\nBytes/Cluster = %lu\nNumber of FATs = %u\n"
								"Root DIR entries = %u\nSectors/FAT = %lu\nNumber of clusters = %lu\n"
								"Volume start (lba) = %lu\nFAT start (lba) = %lu\nDIR start (lba,clustor) = %lu\nData start (lba) = %lu\n\n",
								ft[fs->fs_type & 3], (DWORD)fs->csize * 512, fs->n_fats,
								fs->n_rootdir, fs->fsize, (DWORD)fs->n_fatent - 2,
								fs->volbase, fs->fatbase, fs->dirbase, fs->database);
		#if _USE_LABEL
						res = f_getlabel(ptr, (char*)Buff, (DWORD*)&p2);
						if (res) { put_rc(res); break; }
						xprintf(Buff[0] ? "Volume name is %s\n" : "No volume label\n", (char*)Buff);
						xprintf("Volume S/N is %04X-%04X\n", (DWORD)p2 >> 16, (DWORD)p2 & 0xFFFF);
		#endif
						AccSize = AccFiles = AccDirs = 0;
						xprintf("...");
						res = scan_files(ptr);
						if (res) { put_rc(res); break; }
						xprintf("\r%u files, %lu bytes.\n%u folders.\n"
								"%lu KiB total disk space.\n%lu KiB available.\n",
								AccFiles, AccSize, AccDirs,
								(fs->n_fatent - 2) * (fs->csize / 2), (DWORD)p1 * (fs->csize / 2)
						);
						break;

					case 'l' :	/* fl [<path>] - Directory listing */
						while (*ptr == ' ') ptr++;
						res = f_opendir(&Dir, ptr);
						if (res) { put_rc(res); break; }
						p1 = s1 = s2 = 0;
						for(;;) {
							res = f_readdir(&Dir, &Finfo);
							if ((res != FR_OK) || !Finfo.fname[0]) break;
							if (Finfo.fattrib & AM_DIR) {
								s2++;
							} else {
								s1++; p1 += Finfo.fsize;
							}
							xprintf("%c%c%c%c%c %u/%02u/%02u %02u:%02u %9lu  %s\n",
									(Finfo.fattrib & AM_DIR) ? 'D' : '-',
									(Finfo.fattrib & AM_RDO) ? 'R' : '-',
									(Finfo.fattrib & AM_HID) ? 'H' : '-',
									(Finfo.fattrib & AM_SYS) ? 'S' : '-',
									(Finfo.fattrib & AM_ARC) ? 'A' : '-',
									(Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,
									(Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63,
									Finfo.fsize,
		#if _USE_LFN
									Lfname[0] ? Lfname : Finfo.fname);
		#else
									Finfo.fname);
		#endif
						}
						xprintf("%4u File(s),%10lu bytes total\n%4u Dir(s)", s1, p1, s2);
						res = f_getfree(ptr, (DWORD*)&p1, &fs);
						if (res == FR_OK)
							xprintf(", %10lu bytes free\n", p1 * fs->csize * 512);
						else
							put_rc(res);
						break;
		#if _USE_FIND
					case 'L' :	/* fL <path> <pattern> - Directory search */
						while (*ptr == ' ') ptr++;
						ptr2 = ptr;
						while (*ptr != ' ') ptr++;
						*ptr++ = 0;
						res = f_findfirst(&Dir, &Finfo, ptr2, ptr);
						while (res == FR_OK && Finfo.fname[0]) {
		#if _USE_LFN
							xprintf("%-12s  %s\n", Finfo.fname, Finfo.lfname);
		#else
							xprintf("%s\n", Finfo.fname);
		#endif
							res = f_findnext(&Dir, &Finfo);
						}
						if (res) put_rc(res);
						f_closedir(&Dir);
						break;
		#endif
					case 'o' :	/* fo <mode> <file> - Open a file */
						if (!xatoi(&ptr, &p1)) break;
						while (*ptr == ' ') ptr++;
						put_rc(f_open(&File[0], ptr, (BYTE)p1));
						break;

					case 'c' :	/* fc - Close a file */
						put_rc(f_close(&File[0]));
						break;

					case 'e' :	/* fe - Seek file pointer */
						if (!xatoi(&ptr, &p1)) break;
						res = f_lseek(&File[0], p1);
						put_rc(res);
						if (res == FR_OK)
							xprintf("fptr=%lu(0x%lX)\n", File[0].fptr, File[0].fptr);
						break;

					case 'd' :	/* fd <len> - read and dump file from current fp */
						if (!xatoi(&ptr, &p1)) break;
						ofs = File[0].fptr;
						while (p1) {
							if ((UINT)p1 >= 16) { cnt = 16; p1 -= 16; }
							else 				{ cnt = p1; p1 = 0; }
							res = f_read(&File[0], Buff, cnt, &cnt);
							if (res != FR_OK) { put_rc(res); break; }
							if (!cnt) break;
							put_dump(Buff, ofs, cnt, DW_CHAR);
							ofs += 16;
						}
						break;

					case 'r' :	/* fr <len> - read file */
						if (!xatoi(&ptr, &p1)) break;
						p2 = 0;
						Timer = 0;
						while (p1) {
							if ((UINT)p1 >= blen) {
								cnt = blen; p1 -= blen;
							} else {
								cnt = p1; p1 = 0;
							}
							res = f_read(&File[0], Buff, cnt, &s2);
							if (res != FR_OK) { put_rc(res); break; }
							p2 += s2;
							if (cnt != s2) break;
						}
						xprintf("%lu bytes read with %lu kB/sec.\n", p2, Timer ? (p2 / Timer) : 0);
						break;

					case 'w' :	/* fw <len> <val> - write file */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;
						memset(Buff, (BYTE)p2, blen);
						p2 = 0;
						Timer = 0;
						while (p1) {
							if ((UINT)p1 >= blen) {
								cnt = blen; p1 -= blen;
							} else {
								cnt = p1; p1 = 0;
							}
							res = f_write(&File[0], Buff, cnt, &s2);
							if (res != FR_OK) { put_rc(res); break; }
							p2 += s2;
							if (cnt != s2) break;
						}
						xprintf("%lu bytes written with %lu kB/sec.\n", p2, Timer ? (p2 / Timer) : 0);
						break;

					case 'n' :	/* fn <org.name> <new.name> - Change name of an object */
						while (*ptr == ' ') ptr++;
						ptr2 = strchr(ptr, ' ');
						if (!ptr2) break;
						*ptr2++ = 0;
						while (*ptr2 == ' ') ptr2++;
						put_rc(f_rename(ptr, ptr2));
						break;

					case 'u' :	/* fu <name> - Unlink an object */
						while (*ptr == ' ') ptr++;
						put_rc(f_unlink(ptr));
						break;

					case 'v' :	/* fv - Truncate file */
						put_rc(f_truncate(&File[0]));
						break;

					case 'k' :	/* fk <name> - Create a directory */
						while (*ptr == ' ') ptr++;
						put_rc(f_mkdir(ptr));
						break;

					case 'a' :	/* fa <atrr> <mask> <name> - Change attribute of an object */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2)) break;
						while (*ptr == ' ') ptr++;
						put_rc(f_chmod(ptr, p1, p2));
						break;

					case 't' :	/* ft <year> <month> <day> <hour> <min> <sec> <name> - Change timestamp of an object */
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;
						Finfo.fdate = ((p1 - 1980) << 9) | ((p2 & 15) << 5) | (p3 & 31);
						if (!xatoi(&ptr, &p1) || !xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;
						Finfo.ftime = ((p1 & 31) << 11) | ((p2 & 63) << 5) | ((p3 >> 1) & 31);
						put_rc(f_utime(ptr, &Finfo));
						break;

