wakabayashiryo/Library/Common/Chan_FatFs/LPC1769fatfs/src/ElectricBoard.c
					case 'x' : /* fx <src.name> <dst.name> - Copy a file */
						while (*ptr == ' ') ptr++;
						ptr2 = strchr(ptr, ' ');
						if (!ptr2) break;
						*ptr2++ = 0;
						while (*ptr2 == ' ') ptr2++;
						xprintf("Opening \"%s\"", ptr);
						res = f_open(&File[0], ptr, FA_OPEN_EXISTING | FA_READ);
						xputc('\n');
						if (res) {
							put_rc(res);
							break;
						}
						xprintf("Creating \"%s\"", ptr2);
						res = f_open(&File[1], ptr2, FA_CREATE_ALWAYS | FA_WRITE);
						xputc('\n');
						if (res) {
							put_rc(res);
							f_close(&File[0]);
							break;
						}
						xprintf("Copying file...");
						Timer = 0;
						p1 = 0;
						for (;;) {
							res = f_read(&File[0], Buff, blen, &s1);
							if (res || s1 == 0) break;   /* error or eof */
							res = f_write(&File[1], Buff, s1, &s2);
							p1 += s2;
							if (res || s2 < s1) break;   /* error or disk full */
						}
						xprintf("\n%lu bytes copied with %lu kB/sec.\n", p1, p1 / Timer);
						f_close(&File[0]);
						f_close(&File[1]);
						break;
		#if _FS_RPATH
					case 'g' :	/* fg <path> - Change current directory */
						while (*ptr == ' ') ptr++;
						put_rc(f_chdir(ptr));
						break;
		#if _FS_RPATH >= 2
					case 'q' :	/* fq - Show current dir path */
						res = f_getcwd(Line, sizeof Line);
						if (res)
							put_rc(res);
						else
							xprintf("%s\n", Line);
						break;
		#endif
		#endif
		#if _USE_LABEL
					case 'b' :	/* fb <name> - Set volume label */
						while (*ptr == ' ') ptr++;
						put_rc(f_setlabel(ptr));
						break;
		#endif	/* _USE_LABEL */
		#if _USE_MKFS
					case 'm' :	/* fm <rule> <csize> - Create file system */
						if (!xatoi(&ptr, &p2) || !xatoi(&ptr, &p3)) break;
						xprintf("The volume will be formatted. Are you sure? (Y/n)=");
						xgets(Line, sizeof Line);
						if (Line[0] == 'Y')
							put_rc(f_mkfs("", (BYTE)p2, (WORD)p3));
						break;
		#endif	/* _USE_MKFS */
					case 'z' :	/* fz [<size>] - Change/Show R/W length for fr/fw/fx command */
						if (xatoi(&ptr, &p1) && p1 >= 1 && p1 <= (long)sizeof Buff)
							blen = p1;
						xprintf("blen=%u\n", blen);
						break;
					}
					break;
		#ifdef SOUND_DEFINED
				case 'p' :	/* p <wavfile> - Play RIFF-WAV file */
					while (*ptr == ' ') ptr++;
					res = f_open(&File[0], ptr, FA_READ);
					if (res) {
						put_rc(res);
					} else {
						load_wav(&File[0], "WAV Player", Buff, sizeof Buff);
						f_close(&File[0]);
					}
					break;
		#endif
				case 't' :	/* t [<year> <mon> <mday> <hour> <min> <sec>] - Set/Show RTC */
					if (xatoi(&ptr, &p1)) {
						rtc.year = (WORD)p1;
						xatoi(&ptr, &p1); rtc.month = (BYTE)p1;
						xatoi(&ptr, &p1); rtc.mday = (BYTE)p1;
						xatoi(&ptr, &p1); rtc.hour = (BYTE)p1;
						xatoi(&ptr, &p1); rtc.min = (BYTE)p1;
						if (!xatoi(&ptr, &p1)) break;
						rtc.sec = (BYTE)p1;
						rtc_settime(&rtc);
					}
					rtc_gettime(&rtc);
					xprintf("%u/%u/%u %02u:%02u:%02u\n", rtc.year, rtc.month, rtc.mday, rtc.hour, rtc.min, rtc.sec);
					break;

				}
//		GPIO2HIGH(4);
//		ThreeWave();
//		Gradation();
//     	GPIO2HIGH(4);
	}
}
void GPIO_Init(void)
{
	//	LPC_PINCON->PINSEL3 |= (3<<24);//GPIO0 pin function select register
	LPC_PINCON->PINSEL4 &= ~(0x0f<<8);//PIO2_4 and PIO2_5 GPIO mode

	//	LPC_PINCON->PINMODE3  |=  (1<<24);//GPIO0 pin mode select register
	LPC_PINCON->PINMODE4 |= (0x0a<<8);//PIO2_4 and PIO2_5 neither pullup nor pulldown

	//GPIO0~4 pin open drain mode select register 0:disable open drain 1:enable open drain
	//ex)LPC_PINCON->PINMODE_OD2 &= ~(1<<12);
	LPC_PINCON->PINMODE_OD2 &= ~(3<<4);//PIO2_4 and PIO2_5  no open drain

	//permit to access GPIO0~4(default: all GPIO can access) 0:can access GPIOx 1:cannot access GPIOx
	//ex)LPC_GPIO0->FIOMASK = 0x0000000;

	//set GPIO0~4 direction 0:input 1:output
	//ex)LPC_GPIO0->FIODIR |= (1<<12);
	LPC_GPIO2->FIODIR |= (3<<4);//PIO2_4 and PIO2_5 output mode

	LPC_GPIO0->FIOCLR = 0xFFFFFFFF;//GPIO0 output low
	LPC_GPIO1->FIOCLR = 0xFFFFFFFF;//GPIO1 output low
	LPC_GPIO2->FIOCLR = 0xFFFFFFFF;//GPIO2 output low
	LPC_GPIO3->FIOCLR = 0xFFFFFFFF;//GPIO3 output low
	LPC_GPIO4->FIOCLR = 0xFFFFFFFF;//GPIO4 output low
}

void TIMER0_IRQHandler(void)
{
	static uint32_t select = 0,blight = 0;

	GPIO2HIGH(5);

	if(select>PIXELHEIGHT/2-1)select=0;
	if(blight>PANELRESOL)blight=0;

	OperatePanel(select,blight);

	select++;
	blight++;

	LPC_TIM0->IR |= (1<<0);

	GPIO2LOW(5);
}

void TIMER2_IRQHandler(void) ;
void TIMER3_IRQHandler(void) ;
void UART0_IRQHandler(void) ;
void UART1_IRQHandler(void) ;
void UART2_IRQHandler(void) ;
void UART3_IRQHandler(void) ;
void PWM1_IRQHandler(void) ;
void I2C0_IRQHandler(void) ;
void I2C1_IRQHandler(void) ;
void I2C2_IRQHandler(void) ;
void SPI_IRQHandler(void) ;
void SSP0_IRQHandler(void) ;
void SSP1_IRQHandler(void) ;
void PLL0_IRQHandler(void) ;
void RTC_IRQHandler(void) ;
void EINT0_IRQHandler(void) ;
void EINT1_IRQHandler(void) ;
void EINT2_IRQHandler(void) ;
void EINT3_IRQHandler(void) ;
void ADC_IRQHandler(void) ;
void BOD_IRQHandler(void) ;
void USB_IRQHandler(void) ;
void CAN_IRQHandler(void) ;
void DMA_IRQHandler(void) ;
void I2S_IRQHandler(void) ;
void ENET_IRQHandler(void) ;
void RIT_IRQHandler(void) ;
void MCPWM_IRQHandler(void) ;
void QEI_IRQHandler(void) ;
void PLL1_IRQHandler(void) ;
void USBActivity_IRQHandler(void) ;
void CANActivity_IRQHandler(void) ;
